[
  {
    "title": "Cer03",
    "slug": "cer03",
    "resume": "Junto con un grupo de compañeros desarrollamos una aplicación web de posventa, con el propósito de simplificar el trabajo a los pequeños negocios de la gestión de ventas y productos, y potenciar aún más a las grandes empresas.",
    "description": "Junto con un grupo de compañeros desarrollamos una aplicación web de posventa, con el propósito de simplificar el trabajo a los pequeños negocios de la gestión de ventas y productos, y potenciar aún más a las grandes empresas.",
    "role": {
      "text": "Como uno de los integrantes del proyecto me encargue de: ",
      "types": [
        "Crear el carrito de compras para las cuentas de vendedores.",
        "Crear la dashboard para las cuentas de empresa (gráficos incluidos).",
        "Realizar validaciones en tiempo real para gran parte de los formularios.",
        "Crear el apartado para crear y editar reviews en las cuentas de empresa.",
        "Realizar la protección de rutas dependiendo del tipo de usuario (si ingresaba como vendedor y empresa)."
      ]
    },
    "technologies": [
      "HTML",
      "CSS",
      "JavaScript",
      "React",
      "Redux",
      "NodeJS",
      "Express",
      "PostgreSQL",
      "Sequelize"
    ],
    "links": {
      "github": "https://github.com/MorasDeFresa/Cer03",
      "deploy": "https://cer03.vercel.app/"
    },
    "image": "https://res.cloudinary.com/dub4acwkh/image/upload/v1705019677/Cer03_up18x9.jpg",
    "tags": {
      "collaborators": true,
      "academy": "Henry"
    },
    "date": "Nov. 2023 - Dic. 2023"
  },
  {
    "title": "NASA Images",
    "slug": "nasaimages",
    "resume": "Desarrolle una aplicación web usando la API de imagenes de la NASA, la cual tenia como objetivo renderizar, buscar, agregar a favoritos y ver detalles de imagenes que proporciona la API, la cual se actualiza cada dia con una imagen nueva.",
    "description": "Desarrolle una aplicación web que tenía como objetivo renderizar imágenes provenientes de la API de la NASA, teniendo así una landing page que se actualiza cada dia con una imagen nueva proveniente de la API, una galería dinámica, un apartado de favoritos (las imágenes renderizadas pueden agregarse al mismo) y los detalles de cada imagen con su explicación.",
    "technologies": [
      "HTML",
      "CSS",
      "Tailwind",
      "Typescript",
      "React",
      "Next",
      "Zustand"
    ],
    "links": {
      "github": "https://github.com/LucasAEscudero/nasa_images",
      "deploy": "https://nasa-images-drab.vercel.app/"
    },
    "image": "https://res.cloudinary.com/dub4acwkh/image/upload/v1707161397/nasaImages_coxbk8.png",
    "tags": {
      "collaborators": false,
      "academy": "Autonomo"
    },
    "date": "Ene. 2023 - Feb. 2023"
  },
  {
    "title": "Videogames",
    "slug": "videogames",
    "resume": "Desarrolle una aplicación web usando la API de RAWG, la cual tenia como objetivo renderizar, filtrar, buscar, crear y ver detalles de videojuegos.",
    "description": "Desarrolle una aplicación web que renderiza videojuegos en tarjetas de la API de RAGW (API de videojuegos) con un paginado de 15 videojuegos (cada uno con sus respectivos detalles) por pagina + filtros y ordenamientos, en la cual se puede buscar (15 primeros resultados) y crear un videojuego como tal a través de un formulario con validaciones en javascript.",
    "technologies": [
      "HTML",
      "CSS",
      "JavaScript",
      "React",
      "Redux",
      "NodeJS",
      "Express",
      "PostgreSQL",
      "Sequelize"
    ],
    "links": {
      "github": "https://github.com/LucasAEscudero/Videogames_Proyect",
      "deploy": "https://videogames-j2d9.onrender.com/"
    },
    "image": "https://res.cloudinary.com/dub4acwkh/image/upload/v1705019679/Videogames_c6wnd6.png",
    "tags": {
      "collaborators": false,
      "academy": "Henry"
    },
    "date": "Oct. 2023 -Nov. 2023"
  },
  {
    "title": "Rick and morty",
    "slug": "rickandmorty",
    "resume": "Desarrolle una aplicación web usando la API de Rick and Morty, la cual tenia como objetivo renderizar, filtrar, agregar a favoritos y ver detalles de los personajes iconicos de la serie.",
    "description": "Desarrolle una app web con un sistema de login (con validaciones hechas en javascript) que tenía como objetivo renderizar y buscar personajes del programa Rick and Morty específicos o aleatoriamente utilizando la Rick-And-Morty-API (API de Rick and Morty), ver características de cada personaje, agregarlos a tus favoritos y/o eliminarlos, además de otras funciones extras como filtrarlos y ordenarlos, mostrar todos los personajes (catalogo) y reproducir música icónica del programa",
    "technologies": [
      "HTML",
      "CSS",
      "JavaScript",
      "React",
      "Redux",
      "NodeJS",
      "Express",
      "PostgreSQL",
      "Sequelize"
    ],
    "links": {
      "github": "https://github.com/LucasAEscudero/RaM_Proyect",
      "youtube": "https://www.youtube.com/watch?v=zRdht6-k8bE"
    },
    "image": "https://res.cloudinary.com/dub4acwkh/image/upload/v1705019678/RickandMorty_g26l6q.jpg",
    "tags": {
      "collaborators": false,
      "academy": "Henry"
    },
    "date": "Ago. 2023 - Oct. 2023"
  }
]
